# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

# TODO здесь ваш код
i = 1
all_expenses = 0

while i != 10:
    expenses = expenses * 1.03
    all_expenses += expenses
    educational_grant += 10000
    i += 1

Ask_sum = all_expenses - educational_grant
print('Студенту надо попросить', Ask_sum, 'рублей')
