# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def add_bun ():
    print("Добавляем булочку")


def add_cutlet():
    print("Добавляем котлету")


def add_cucumber():
    print("Добавляем огурец")


def add_tomato():
    print("Добавляем помидор")


def add_mayo():
    print("Добавляем майонез")


def add_cheese():
    print("Добавляем сыр")